saprykin/plibsys/src/psocket.c
/*
 * Copyright (C) 2008 Christian Kellner, Samuel Cormier-Iijima
 * Copyright (C) 2009 Codethink Limited
 * Copyright (C) 2009 Red Hat, Inc
 * Copyright (C) 2010-2016 Alexander Saprykin <xelfium@gmail.com>
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301  USA.
 */

#include "pmem.h"
#include "psocket.h"
#include "plib-private.h"

#include <stdlib.h>
#include <string.h>

#ifndef P_OS_WIN
#include <fcntl.h>
#include <errno.h>
#include <unistd.h>
#include <signal.h>
#include <sys/poll.h>
#else
#include <winsock2.h>
#include <windows.h>
#endif

#ifndef PLIB_HAS_SOCKLEN_T
typedef int socklen_t;
#endif

#ifndef PLIB_HAS_SOCKADDR_STORAGE
/* According to RFC 2553 */
#  define _PLIB_SS_MAXSIZE	128
#  define _PLIB_SS_ALIGNSIZE	(sizeof (pint64))

#  ifdef PLIB_SOCKADDR_HAS_SA_LEN
#    define _PLIB_SS_PAD1SIZE	(_PLIB_SS_ALIGNSIZE - (sizeof (puchar) + sizeof (puchar)))
#  else
#    define _PLIB_SS_PAD1SIZE	(_PLIB_SS_ALIGNSIZE - sizeof (puchar))
#  endif

#  define _PLIB_SS_PAD2SIZE	(_PLIB_SS_MAXSIZE - (sizeof (puchar) + _PLIB_SS_PAD1SIZE + _PLIB_SS_ALIGNSIZE))

struct sockaddr_storage {
#  ifdef PLIB_SOCKADDR_HAS_SA_LEN
	puchar		ss_len;
#  endif
	puchar		ss_family;
	pchar		__ss_pad1[_PLIB_SS_PAD1SIZE];
	pint64		__ss_align;
	pchar		__ss_pad2[_PLIB_SS_PAD2SIZE];
};
#endif

/* On old Solaris systems SOMAXCONN is set to 5 */
#define P_SOCKET_DEFAULT_BACKLOG	5

struct _PSocket {
	PSocketFamily	family;
	PSocketProtocol	protocol;
	PSocketType	type;
	pint		fd;
	pint		listen_backlog;
	pint		timeout;
	puint		inited		: 1;
	puint		blocking	: 1;
	puint		keepalive	: 1;
	puint		closed		: 1;
	puint		connected	: 1;
	puint		listening	: 1;
#ifdef P_OS_WIN
	WSAEVENT	events;
#endif
};

#ifndef SHUT_RD
#  define SHUT_RD			0
#endif

#ifndef SHUT_WR
#  define SHUT_WR			1
#endif

#ifndef SHUT_RDWR
#  define SHUT_RDWR			2
#endif

#ifdef MSG_NOSIGNAL
#  define P_SOCKET_DEFAULT_SEND_FLAGS	MSG_NOSIGNAL
#else
#  define P_SOCKET_DEFAULT_SEND_FLAGS	0
#endif

static pint __p_socket_get_errno (void);
static pboolean __p_socket_set_fd_blocking (pint fd, pboolean blocking, PError **error);
static pboolean __p_socket_check (const PSocket *socket, PError **error);
static pboolean __p_socket_set_details_from_fd (PSocket *socket, PError **error);

static pint __p_socket_get_errno (void)
{
#ifdef P_OS_WIN
	return WSAGetLastError ();
#else
	return errno;
#endif
}

static pboolean
__p_socket_set_fd_blocking (pint	fd,
			    pboolean	blocking,
			    PError	**error)
{
#ifndef P_OS_WIN
	pint32 arg;
#else
	pulong arg;
#endif

#ifndef P_OS_WIN
	if ((arg = fcntl (fd, F_GETFL, NULL)) < 0) {
		P_WARNING ("PSocket: error getting socket flags");
		arg = 0;
	}

	arg = (!blocking) ? (arg | O_NONBLOCK) : (arg & ~O_NONBLOCK);

	if (fcntl (fd, F_SETFL, arg) < 0) {
#else
	arg = !blocking;

	if (ioctlsocket (fd, FIONBIO, &arg) == SOCKET_ERROR) {
#endif
		p_error_set_error_p (error,
				     (pint) __p_error_get_io_from_system (__p_socket_get_errno ()),
				     (pint) __p_socket_get_errno (),
				     "Failed to set socket blocking flags");
		return FALSE;
	}

	return TRUE;
}

static pboolean
__p_socket_check (const PSocket *socket,
		  PError	**error)
{
	if (!socket->inited) {
		p_error_set_error_p (error,
				     (pint) P_ERROR_IO_INVALID_ARGUMENT,
				     0,
				     "Socket is not initialized");
		return FALSE;
	}

	if (socket->closed)  {
		p_error_set_error_p (error,
				     (pint) P_ERROR_IO_NOT_AVAILABLE,
				     0,
				     "Socket is already closed");
		return FALSE;
	}

	return TRUE;
}

static pboolean
__p_socket_set_details_from_fd (PSocket	*socket,
				PError	**error)
{
	PSocketFamily		family;
	struct sockaddr_storage	address;
	pint			fd, value;
	socklen_t		addrlen, optlen;
#ifdef P_OS_WIN
	/* See comment below */
	BOOL			bool_val = FALSE;
#else
	pint			bool_val;
#endif

	fd = socket->fd;
	optlen = sizeof (value);

	if (getsockopt (fd, SOL_SOCKET, SO_TYPE, (ppointer) &value, &optlen) != 0) {
		p_error_set_error_p (error,
				     (pint) __p_error_get_io_from_system (__p_socket_get_errno ()),
				     (pint) __p_socket_get_errno (),
				     "Failed to call getsockopt() to get socket info for fd");
		return FALSE;
	}

	if (optlen != sizeof (value)) {
		p_error_set_error_p (error,
				     (pint) P_ERROR_IO_INVALID_ARGUMENT,
				     0,
				     "Failed to get socket info for fd, bad option length");
		return FALSE;
	}

	switch (value) {
	case SOCK_STREAM:
		socket->type = P_SOCKET_TYPE_STREAM;
		break;

	case SOCK_DGRAM:
		socket->type = P_SOCKET_TYPE_DATAGRAM;
		break;

	case SOCK_SEQPACKET:
		socket->type = P_SOCKET_TYPE_SEQPACKET;
		break;

	default:
		socket->type = P_SOCKET_TYPE_UNKNOWN;
		break;
	}

	addrlen = sizeof (address);

	if (getsockname (fd, (struct sockaddr *) &address, &addrlen) != 0) {
		p_error_set_error_p (error,
				     (pint) __p_error_get_io_from_system (__p_socket_get_errno ()),
				     (pint) __p_socket_get_errno (),
				     "Failed to call getsockname() to get socket address info");
		return FALSE;
	}

	if (addrlen > 0)
		family = address.ss_family;
	else {
#ifdef SO_DOMAIN
		optlen = sizeof (family);

		if (getsockopt (socket->fd, SOL_SOCKET, SO_DOMAIN, (ppointer) &family, &optlen) != 0) {
			p_error_set_error_p (error,
					     (pint) __p_error_get_io_from_system (__p_socket_get_errno ()),
					     (pint) __p_socket_get_errno (),
					     "Failed to call getsockopt() to get socket SO_DOMAIN option");
			return FALSE;
		}
#endif
	}

	switch (address.ss_family) {
	case P_SOCKET_FAMILY_INET:
		socket->family = P_SOCKET_FAMILY_INET;
		break;
#ifdef AF_INET6
	case P_SOCKET_FAMILY_INET6:
		socket->family = P_SOCKET_FAMILY_INET6;
		break;
#endif
	default:
		socket->family = P_SOCKET_FAMILY_UNKNOWN;
		break;
	}

#ifdef AF_INET6
	if (socket->family == P_SOCKET_FAMILY_INET6 || socket->family == P_SOCKET_FAMILY_INET) {
#else
	if (socket->family == P_SOCKET_FAMILY_INET) {
#endif
		switch (socket->type) {
		case P_SOCKET_TYPE_STREAM:
			socket->protocol = P_SOCKET_PROTOCOL_TCP;
			break;
		case P_SOCKET_TYPE_DATAGRAM:
			socket->protocol = P_SOCKET_PROTOCOL_UDP;
			break;
		case P_SOCKET_TYPE_SEQPACKET:
			socket->protocol = P_SOCKET_PROTOCOL_SCTP;
			break;
		default:
			break;
		}
	}

	if (socket->family != P_SOCKET_FAMILY_UNKNOWN) {
		addrlen = sizeof (address);

		if (getpeername (fd, (struct sockaddr *) &address, &addrlen) >= 0)
			socket->connected = TRUE;
	}

