saprykin/plibsys/src/psocket.c
	optlen = sizeof (bool_val);

	if (getsockopt (fd, SOL_SOCKET, SO_KEEPALIVE, (ppointer) &bool_val, &optlen) == 0)  {
#ifndef P_OS_WIN
		/* Experimentation indicates that the SO_KEEPALIVE value is
		 * actually a char on Windows, even if documentation claims it
		 * to be a BOOL which is a typedef for int. */
		if (optlen != sizeof (bool_val))
			P_WARNING ("PSocket: failed to get socket keepalive flag");
#endif
		socket->keepalive = !!bool_val;
	}  else
		/* Can't read, maybe not supported, assume FALSE */
		socket->keepalive = FALSE;

	return TRUE;
}

pboolean
__p_socket_init_once (void)
{
#ifdef P_OS_WIN
	WORD	ver_req;
	WSADATA	wsa_data;
	pint	err;

	ver_req = MAKEWORD (2, 2);

	if ((err = WSAStartup (ver_req, &wsa_data)) != 0)
		return FALSE;

	if (LOBYTE (wsa_data.wVersion) != 2 || HIBYTE (wsa_data.wVersion ) != 2 ) {
		WSACleanup ();
		return FALSE;
	}
#else
#  ifdef SIGPIPE
	signal (SIGPIPE, SIG_IGN);
#  endif
#endif
	return TRUE;
}

void
__p_socket_close_once (void)
{
#ifdef P_OS_WIN
	WSACleanup ();
#endif
}

P_LIB_API PSocket *
p_socket_new_from_fd (pint	fd,
		      PError	**error)
{
	PSocket *ret;

	if (fd < 0) {
		p_error_set_error_p (error,
				     (pint) P_ERROR_IO_INVALID_ARGUMENT,
				     0,
				     "Unable to create socket from bad fd");
		return NULL;
	}

	if ((ret = p_malloc0 (sizeof (PSocket))) == NULL) {
		p_error_set_error_p (error,
				     (pint) P_ERROR_IO_NO_RESOURCES,
				     0,
				     "Failed to allocate memory for socket");
		return NULL;
	}

	ret->fd = fd;

	if (__p_socket_set_details_from_fd (ret, error) == FALSE) {
		p_free (ret);
		return NULL;
	}

	if (__p_socket_set_fd_blocking (ret->fd, FALSE, error) == FALSE) {
		p_free (ret);
		return NULL;
	}

	p_socket_set_listen_backlog (ret, P_SOCKET_DEFAULT_BACKLOG);

	ret->timeout = 0;
	ret->blocking = TRUE;
	ret->inited = TRUE;

#ifdef P_OS_WIN
	if ((ret->events = WSACreateEvent ()) == WSA_INVALID_EVENT) {
		p_error_set_error_p (error,
				     (pint) P_ERROR_IO_FAILED,
				     (pint) __p_socket_get_errno (),
				     "Failed to call WSACreateEvent() on socket");
		p_free (ret);
		return NULL;
	}
#endif

	return ret;
}

P_LIB_API PSocket *
p_socket_new (PSocketFamily	family,
	      PSocketType	type,
	      PSocketProtocol	protocol,
	      PError		**error)
{
	PSocket	*ret;
	pint	native_type, fd;
#ifndef P_OS_WIN
	pint	flags;
#endif

	if (family == P_SOCKET_FAMILY_UNKNOWN ||
	    type == P_SOCKET_TYPE_UNKNOWN ||
	    protocol == P_SOCKET_PROTOCOL_UNKNOWN) {
		p_error_set_error_p (error,
				     (pint) P_ERROR_IO_INVALID_ARGUMENT,
				     0,
				     "Invalid input socket family, type or protocol");
		return NULL;
	}

	switch (type) {
	case P_SOCKET_TYPE_STREAM:
		native_type = SOCK_STREAM;
		break;

	case P_SOCKET_TYPE_DATAGRAM:
		native_type = SOCK_DGRAM;
		break;

	case P_SOCKET_TYPE_SEQPACKET:
		native_type = SOCK_SEQPACKET;
		break;

	default:
		p_error_set_error_p (error,
				     (pint) P_ERROR_IO_INVALID_ARGUMENT,
				     0,
				     "Unable to create socket with unknown family");
		return NULL;
	}

	if (protocol == -1)  {
		p_error_set_error_p (error,
				     (pint) P_ERROR_IO_INVALID_ARGUMENT,
				     0,
				     "Unable to create socket with unknown protocol");
		return NULL;
	}

#ifdef SOCK_CLOEXEC
	native_type |= SOCK_CLOEXEC;
#endif
	if ((fd = (pint) socket (family, native_type, protocol)) < 0) {
		p_error_set_error_p (error,
				     (pint) __p_error_get_io_from_system (__p_socket_get_errno ()),
				     (pint) __p_socket_get_errno (),
				     "Failed to call socket() to create socket");
		return NULL;
	}

#ifndef P_OS_WIN
	flags = fcntl (fd, F_GETFD, 0);

	if (flags != -1 && (flags & FD_CLOEXEC) == 0) {
		flags |= FD_CLOEXEC;
		fcntl (fd, F_SETFD, flags);
	}
#endif

	if ((ret = p_malloc0 (sizeof (PSocket))) == NULL) {
		p_error_set_error_p (error,
				     (pint) P_ERROR_IO_NO_RESOURCES,
				     0,
				     "Failed to allocate memory for socket");
#ifndef P_OS_WIN
		close (fd);
#else
		closesocket (fd);
#endif
		return NULL;
	}

	ret->fd = fd;

	if (__p_socket_set_fd_blocking (ret->fd, FALSE, error) == FALSE) {
#ifndef P_OS_WIN
		close (fd);
#else
		closesocket (fd);
#endif
		p_free (ret);
		return NULL;
	}

	ret->timeout = 0;
	ret->blocking = TRUE;
	ret->family = family;
	ret->protocol = protocol;
	ret->type = type;
	ret->inited = TRUE;

	p_socket_set_listen_backlog (ret, P_SOCKET_DEFAULT_BACKLOG);

#ifdef P_OS_WIN
	if ((ret->events = WSACreateEvent ()) == WSA_INVALID_EVENT) {
		p_error_set_error_p (error,
				     (pint) P_ERROR_IO_FAILED,
				     (pint) __p_socket_get_errno (),
				     "Failed to call WSACreateEvent() on socket");
		p_socket_free (ret);
		return NULL;
	}
#endif

	return ret;
}

P_LIB_API pint
p_socket_get_fd (const PSocket *socket)
{
	if (!socket)
		return -1;

	return socket->fd;
}

P_LIB_API PSocketFamily
p_socket_get_family (const PSocket *socket)
{
	if (!socket)
		return P_SOCKET_FAMILY_UNKNOWN;

	return socket->family;
}

P_LIB_API PSocketType
p_socket_get_type (const PSocket *socket)
{
	if (!socket)
		return P_SOCKET_TYPE_UNKNOWN;

	return socket->type;
}

P_LIB_API PSocketProtocol
p_socket_get_protocol (const PSocket *socket)
{
	if (!socket)
		return P_SOCKET_PROTOCOL_UNKNOWN;

	return socket->protocol;
}

P_LIB_API pboolean
p_socket_get_keepalive (const PSocket *socket)
{
	if (!socket)
		return FALSE;

	return socket->keepalive;
}

P_LIB_API pboolean
p_socket_get_blocking (PSocket *socket)
{
	if (!socket)
		return FALSE;

	return socket->blocking;
}

P_LIB_API int
p_socket_get_listen_backlog (const PSocket *socket)
{
	if (!socket)
		return -1;

	return socket->listen_backlog;
}

P_LIB_API pint
p_socket_get_timeout (const PSocket *socket)
{
	if (!socket)
		return -1;

	return socket->timeout;
}

P_LIB_API PSocketAddress *
p_socket_get_local_address (const PSocket	*socket,
			    PError		**error)
{
	struct sockaddr_storage	buffer;
	socklen_t		len;
	PSocketAddress		*ret;

	if (!socket) {
		p_error_set_error_p (error,
				     (pint) P_ERROR_IO_INVALID_ARGUMENT,
				     0,
				     "Invalid input argument");
		return NULL;
	}

	len = sizeof (buffer);

	if (getsockname (socket->fd, (struct sockaddr *) &buffer, &len) < 0) {
		p_error_set_error_p (error,
				     (pint) __p_error_get_io_from_system (__p_socket_get_errno ()),
				     (pint) __p_socket_get_errno (),
				     "Failed to call getsockname() to get local socket address");
		return NULL;
	}

