saprykin/plibsys/src/psocket.c
	ret = p_socket_address_new_from_native (&buffer, (psize) len);

	if (ret == NULL)
		p_error_set_error_p (error,
				     (pint) P_ERROR_IO_FAILED,
				     0,
				     "Failed to create socket address from native structure");

	return ret;
}

P_LIB_API PSocketAddress *
p_socket_get_remote_address (const PSocket	*socket,
			     PError		**error)
{
	struct sockaddr_storage	buffer;
	socklen_t 		len;
	PSocketAddress		*ret;

	if (!socket) {
		p_error_set_error_p (error,
				     (pint) P_ERROR_IO_INVALID_ARGUMENT,
				     0,
				     "Invalid input argument");
		return NULL;
	}

	len = sizeof (buffer);

	if (getpeername (socket->fd, (struct sockaddr *) &buffer, &len) < 0) {
		p_error_set_error_p (error,
				     (pint) __p_error_get_io_from_system (__p_socket_get_errno ()),
				     (pint) __p_socket_get_errno (),
				     "Failed to call getpeername() to get remote socket address");
		return NULL;
	}

	ret = p_socket_address_new_from_native (&buffer, (psize) len);

	if (ret == NULL)
		p_error_set_error_p (error,
				     (pint) P_ERROR_IO_FAILED,
				     0,
				     "Failed to create socket address from native structure");

	return ret;
}

P_LIB_API pboolean
p_socket_is_connected (const PSocket *socket)
{
	if (!socket)
		return FALSE;

	return socket->connected;
}

P_LIB_API pboolean
p_socket_check_connect_result (PSocket  *socket,
			       PError	**error)
{
	socklen_t	optlen;
	pint		val;

	if (!socket) {
		p_error_set_error_p (error,
				     (pint) P_ERROR_IO_INVALID_ARGUMENT,
				     0,
				     "Invalid input argument");
		return FALSE;
	}

	optlen = sizeof (val);

	if (getsockopt (socket->fd, SOL_SOCKET, SO_ERROR, (ppointer) &val, &optlen) < 0) {
		p_error_set_error_p (error,
				     (pint) __p_error_get_io_from_system (__p_socket_get_errno ()),
				     (pint) __p_socket_get_errno (),
				     "Failed to call getsockopt() to get connection status");
		return FALSE;
	}

	if (val != 0)
		p_error_set_error_p (error,
				     (pint) __p_error_get_io_from_system (val),
				     val,
				     "Error in socket layer");

	socket->connected = (val == 0);

	return (val == 0);
}

P_LIB_API void
p_socket_set_keepalive (PSocket		*socket,
			pboolean	keepalive)
{
#ifdef P_OS_WIN
	pchar val;
#else
	pint val;
#endif

	if (!socket)
		return;

	if (socket->keepalive == (puint) !!keepalive)
		return;

#ifdef P_OS_WIN
	val = !! (pchar) keepalive;
#else
	val = !! (pint) keepalive;
#endif
	if (setsockopt (socket->fd, SOL_SOCKET, SO_KEEPALIVE, &val, sizeof (val)) < 0) {
		P_WARNING ("PSocket: failed to set keepalive flag");
		return;
	}

	socket->keepalive = !! (pint) keepalive;
}

P_LIB_API void
p_socket_set_blocking (PSocket	*socket,
		       pboolean	blocking)
{
	if (!socket)
		return;

	socket->blocking = blocking;
}

P_LIB_API void
p_socket_set_listen_backlog (PSocket	*socket,
			     pint	backlog)
{
	if (!socket || socket->listening)
		return;

	socket->listen_backlog = backlog;
}

P_LIB_API void
p_socket_set_timeout (PSocket	*socket,
		      pint	timeout)
{
	if (!socket)
		return;

	if (timeout < 0)
		timeout = 0;

	socket->timeout = timeout;
}

P_LIB_API pboolean
p_socket_bind (const PSocket	*socket,
	       PSocketAddress	*address,
	       pboolean		allow_reuse,
	       PError		**error)
{
	struct sockaddr_storage	addr;
#ifndef P_OS_WIN
	pint			value;
#endif

#ifdef P_OS_WIN
	P_UNUSED (allow_reuse);
#endif

	if (!socket || !address) {
		p_error_set_error_p (error,
				     (pint) P_ERROR_IO_INVALID_ARGUMENT,
				     0,
				     "Invalid input argument");
		return FALSE;
	}

	if (!__p_socket_check (socket, error))
		return FALSE;

	/* SO_REUSEADDR on Windows means something else and is not what we want.
	   It always allows the UNIX variant of SO_REUSEADDR anyway */
#ifndef P_OS_WIN
	value = !! (pint) allow_reuse;
	/* Ignore errors here, the only likely error is "not supported", and
	   this is a "best effort" thing mainly */
	setsockopt (socket->fd, SOL_SOCKET, SO_REUSEADDR, &value, sizeof (value));
#endif

	if (!p_socket_address_to_native (address, &addr, sizeof (addr))) {
		p_error_set_error_p (error,
				     (pint) P_ERROR_IO_FAILED,
				     0,
				     "Failed to convert socket address to native structure");
		return FALSE;
	}

	if (bind (socket->fd, (struct sockaddr *) &addr, (pint) p_socket_address_get_native_size (address)) < 0) {
		p_error_set_error_p (error,
				     (pint) __p_error_get_io_from_system (__p_socket_get_errno ()),
				     (pint) __p_socket_get_errno (),
				     "Failed to call bind() on socket");
		return FALSE;
	}

	return TRUE;
}

P_LIB_API pboolean
p_socket_connect (PSocket		*socket,
		  PSocketAddress	*address,
		  PError		**error)
{
	struct sockaddr_storage	buffer;
	pint			err_code;
	PErrorIO		sock_err;

	if (!socket || !address) {
		p_error_set_error_p (error,
				     (pint) P_ERROR_IO_INVALID_ARGUMENT,
				     0,
				     "Invalid input argument");
		return FALSE;
	}

	if (!__p_socket_check (socket, error))
		return FALSE;

	if (!p_socket_address_to_native (address, &buffer, sizeof buffer)) {
		p_error_set_error_p (error,
				     (pint) P_ERROR_IO_FAILED,
				     0,
				     "Failed to convert socket address to native structure");
		return FALSE;
	}

	for (;;) {
		if (connect (socket->fd, (struct sockaddr *) &buffer,
			     (pint) p_socket_address_get_native_size (address)) < 0) {
			err_code = __p_socket_get_errno ();
#if !defined (P_OS_WIN) && defined (EINTR)
			if (err_code == EINTR)
				continue;
#endif
			sock_err = __p_error_get_io_from_system (err_code);

			if (sock_err == P_ERROR_IO_WOULD_BLOCK || sock_err == P_ERROR_IO_IN_PROGRESS) {
				if (socket->blocking) {
					if (p_socket_io_condition_wait (socket,
									P_SOCKET_IO_CONDITION_POLLOUT,
									error) == TRUE &&
					    p_socket_check_connect_result (socket, error) == TRUE)
						break;
				} else
					p_error_set_error_p (error,
							     (pint) sock_err,
							     err_code,
							     "Couldn't block non-blocking socket");

			} else
				p_error_set_error_p (error,
						     (pint) sock_err,
						     err_code,
						     "Failed to call connect() on socket");

			return FALSE;
		}

		break;
	}

