saprykin/plibsys/src/psocket.c
	optlen = (socklen_t) p_socket_address_get_native_size (address);

	for (;;) {
		if (socket->blocking &&
		    p_socket_io_condition_wait (socket, P_SOCKET_IO_CONDITION_POLLOUT, error) == FALSE)
			return -1;

		if ((ret = sendto (socket->fd, buffer, (pint32) buflen, 0, (struct sockaddr *) &sa, optlen)) < 0) {
			err_code = __p_socket_get_errno ();

#if !defined (P_OS_WIN) && defined (EINTR)
			if (err_code == EINTR)
				continue;
#endif
			sock_err = __p_error_get_io_from_system (err_code);

			if (socket->blocking && sock_err == P_ERROR_IO_WOULD_BLOCK)
				continue;

			p_error_set_error_p (error,
					     (pint) sock_err,
					     err_code,
					     "Failed to call sendto() on socket");

			return -1;
		}

		break;
	}

	return ret;
}

P_LIB_API pboolean
p_socket_close (PSocket	*socket,
		PError	**error)
{
	pint	res;
	pint	err_code;

	if (!socket) {
		p_error_set_error_p (error,
				     (pint) P_ERROR_IO_INVALID_ARGUMENT,
				     0,
				     "Invalid input argument");
		return FALSE;
	}

	if (socket->closed)
		return TRUE;

	if (!__p_socket_check (socket, error))
		return FALSE;

	for (;;) {
#ifdef P_OS_WIN
		res = closesocket (socket->fd);
#else
		res = close (socket->fd);
#endif
		if (res == -1) {
			err_code = __p_socket_get_errno ();
#if !defined (P_OS_WIN) && defined (EINTR)
			if (err_code == EINTR)
				continue;
#endif
			p_error_set_error_p (error,
					     (pint) __p_error_get_io_from_system (err_code),
					     err_code,
					     "Failed to close socket");

			return FALSE;
		}

		break;
	}

	socket->connected = FALSE;
	socket->closed = TRUE;
	socket->listening = FALSE;

	return TRUE;
}

P_LIB_API pboolean
p_socket_shutdown (PSocket	*socket,
		   pboolean	shutdown_read,
		   pboolean	shutdown_write,
		   PError	**error)
{
	pint how;

	if (!socket) {
		p_error_set_error_p (error,
				     (pint) P_ERROR_IO_INVALID_ARGUMENT,
				     0,
				     "Invalid input argument");
		return FALSE;
	}

	if (!__p_socket_check (socket, error))
		return FALSE;

	if (!shutdown_read && !shutdown_write)
		return TRUE;

#ifndef P_OS_WIN
	if (shutdown_read && shutdown_write)
		how = SHUT_RDWR;
	else if (shutdown_read)
		how = SHUT_RD;
	else
		how = SHUT_WR;
#else
	if (shutdown_read && shutdown_write)
		how = SD_BOTH;
	else if (shutdown_read)
		how = SD_RECEIVE;
	else
		how = SD_SEND;
#endif

	if (shutdown (socket->fd, how) != 0) {
		p_error_set_error_p (error,
				     (pint) __p_error_get_io_from_system (__p_socket_get_errno ()),
				     (pint) __p_socket_get_errno (),
				     "Failed to call shutdown() on socket");
		return FALSE;
	}

	if (shutdown_read && shutdown_write)
		socket->connected = FALSE;

	return TRUE;
}

P_LIB_API void
p_socket_free (PSocket *socket)
{
	if (!socket)
		return;

#ifdef P_OS_WIN
	if (socket->events)
		WSACloseEvent (socket->events);
#endif

	p_socket_close (socket, NULL);
	p_free (socket);
}

P_LIB_API pboolean
p_socket_set_buffer_size (const PSocket		*socket,
			  PSocketDirection	dir,
			  psize			size,
			  PError		**error)
{
	pint	optname;
	pint	optval;

	if (socket == NULL) {
		p_error_set_error_p (error,
				     (pint) P_ERROR_IO_INVALID_ARGUMENT,
				     0,
				     "Invalid input argument");
		return FALSE;
	}

	optname = (dir == P_SOCKET_DIRECTION_RCV) ? SO_RCVBUF : SO_SNDBUF;
	optval	= (pint) size;

	if (setsockopt (socket->fd, SOL_SOCKET, optname, (pconstpointer) &optval, sizeof (optval)) != 0) {
		p_error_set_error_p (error,
				     (pint) __p_error_get_io_from_system (__p_socket_get_errno ()),
				     (pint) __p_socket_get_errno (),
				     "Failed to call setsockopt() on socket to set buffer size");
		return FALSE;
	}

	return TRUE;
}

P_LIB_API pboolean
p_socket_io_condition_wait (const PSocket	*socket,
			    PSocketIOCondition	condition,
			    PError		**error)
{
#ifdef P_OS_WIN
	long		network_events;
#else
	struct pollfd	pfd;
#endif
	pint		evret;
	pint		timeout;

	if (socket == NULL) {
		p_error_set_error_p (error,
				     (pint) P_ERROR_IO_INVALID_ARGUMENT,
				     0,
				     "Invalid input argument");
		return FALSE;
	}

	if (__p_socket_check (socket, error) == FALSE)
		return FALSE;

#ifdef P_OS_WIN
	timeout = socket->timeout > 0 ? socket->timeout : WSA_INFINITE;

	if (condition == P_SOCKET_IO_CONDITION_POLLIN)
		network_events = FD_READ | FD_ACCEPT;
	else
		network_events = FD_WRITE | FD_CONNECT;

	WSAResetEvent (socket->events);
	WSAEventSelect (socket->fd, socket->events, network_events);

	evret = WSAWaitForMultipleEvents (1, (const HANDLE *) &socket->events, TRUE, timeout, FALSE);

	if (evret == WSA_WAIT_EVENT_0)
		return TRUE;
	else if (evret == WSA_WAIT_TIMEOUT) {
		p_error_set_error_p (error,
				     (pint) P_ERROR_IO_TIMED_OUT,
				     (pint) __p_socket_get_errno (),
				     "Timed out while waiting socket condition");
		return FALSE;
	} else {
		p_error_set_error_p (error,
				     (pint) __p_error_get_io_from_system (__p_socket_get_errno ()),
				     (pint) __p_socket_get_errno (),
				     "Failed to call WSAWaitForMultipleEvents() on socket");
		return FALSE;
	}
#else
	timeout = socket->timeout > 0 ? socket->timeout : -1;

	pfd.fd = socket->fd;
	pfd.revents = 0;

	if (condition == P_SOCKET_IO_CONDITION_POLLIN)
		pfd.events = POLLIN;
	else
		pfd.events = POLLOUT;

	while (TRUE) {
		evret = poll (&pfd, 1, timeout);

#ifdef EINTR
		if (evret == -1 && __p_socket_get_errno () == EINTR)
			continue;
#endif

		if (evret == 1)
			return TRUE;
		else if (evret == 0) {
			p_error_set_error_p (error,
					     (pint) P_ERROR_IO_TIMED_OUT,
					     (pint) __p_socket_get_errno (),
					     "Timed out while waiting socket condition");
			return FALSE;
		} else {
			p_error_set_error_p (error,
					     (pint) __p_error_get_io_from_system (__p_socket_get_errno ()),
					     (pint) __p_socket_get_errno (),
					     "Failed to call poll() on socket");
			return FALSE;
		}
	}
#endif
}
